app/controllers/jobs_controller.rb

  def index
		if params[:category].blank?
			@jobs = Job.all.order("created_at DESC")
		else
			@category_id = Category.find_by(name: params[:category]).id
---
SELECT "categories".* FROM "categories"
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Full-time"], ["LIMIT", 1]]